# TreadDepthFailsEq Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..TreadDepthFailsEq Property
BuiltInFailures..::..StairRampFailures Class See Also
---
The actual tread depth and riser height for one or more stairs of this type violates the stair equation.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId TreadDepthFailsEq { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TreadDepthFailsEq As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ TreadDepthFailsEq {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace